using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;

namespace YunDingCombination
{
    static class TriggerEffect
    {
        public static Dictionary<string, string> effect = new Dictionary<string, string>
        {
            {"2恶魔","恶魔的攻击有25%几率灼烧一名敌人的所有法力值并造成等额的真实伤害"},
            {"3恶魔","恶魔的攻击有25%几率灼烧一名敌人的所有法力值并造成等额的真实伤害"},
            {"4恶魔","恶魔的攻击有50%几率灼烧一名敌人的所有法力值并造成等额的真实伤害"},
            {"5恶魔","恶魔的攻击有50%几率灼烧一名敌人的所有法力值并造成等额的真实伤害"},
            {"6恶魔","恶魔的攻击有80%几率灼烧一名敌人的所有法力值并造成等额的真实伤害"},
            {"2龙","龙免疫魔法伤害"},
            {"1浪人","战斗开始时，如果一名浪人的邻近格子没有友军，那么该浪人会获得一层等于他生命值100%的护盾"},
            {"2极地","冰川的攻击有20%造成晕眩效果"},
            {"3极地","冰川的攻击有20%造成晕眩效果"},
            {"4极地","冰川的攻击有30%几率对目标造成持续2秒的晕眩效果"},
            {"5极地","冰川的攻击有30%几率对目标造成持续2秒的晕眩效果"},
            {"6极地","冰川的攻击有45%几率对目标造成持续2秒的晕眩效果"},
            {"2帝国","1个随机的帝国造成双倍伤害"},
            {"3帝国","1个随机的帝国造成双倍伤害"},
            {"4帝国","拥有4个帝国时，所有帝国造成双倍伤害"},
            {"1忍者","你的场上恰好拥有1个忍者时，提高该忍者40%攻击伤害"},
            {"2忍者","你的场上恰好拥有1个忍者时，提高该忍者40%攻击伤害"},
            {"3忍者","你的场上恰好拥有1个忍者时，提高该忍者40%攻击伤害"},
            {"4忍者","拥有4名忍者，所有忍者会提高80%攻击伤害"},
            {"3贵族","增加1个随机友军100点护甲并且每次攻击治疗该友军35点生命值"},
            {"4贵族","增加1个随机友军100点护甲并且每次攻击治疗该友军35点生命值"},
            {"5贵族","增加1个随机友军100点护甲并且每次攻击治疗该友军35点生命值"},
            {"6贵族","增加所有友军100点护甲并且每次攻击治疗该友军35点生命值"},
            {"2暗影","在战斗开始时诅咒一名随机的敌人，将其生命值设置为100"},
            {"3海盗","在与另一名玩家作战之后，最多可赚取4枚额外的金币"},
            {"1机器人","机器人在开始战斗时就有满额的法力值"},
            {"3虚空","整个队伍的所有普攻无视敌人50%的护甲"},
            {"2狂野","狂野的攻击会生成怒气层数，最多5层，每层怒气提供8%的攻击速度加成"},
            {"3狂野","狂野的攻击会生成怒气层数，最多5层，每层怒气提供8%的攻击速度加成"},
            {"4狂野","所有友军的攻击会生成怒气层数，最多5层，每层怒气提供8%的攻击速度加成"},
            {"3约德尔人","对友方约德尔人进行的攻击会有25%几率未命中"},
            {"4约德尔人","对友方约德尔人进行的攻击会有25%几率未命中"},
            {"5约德尔人","对友方约德尔人进行的攻击会有25%几率未命中"},
            {"6约德尔人","对友方约德尔人进行的攻击会有60%几率未命中"},
            {"3法师","增加35%技能强度"},
            {"4法师","增加35%技能强度"},
            {"5法师","增加35%技能强度"},
            {"6法师","增加100%技能强度"},
            {"3刺客","刺客会获得150%的暴击伤害"},
            {"4刺客","刺客会获得150%的暴击伤害"},
            {"5刺客","刺客会获得150%的暴击伤害"},
            {"6刺客","刺客会获得350%的暴击伤害"},
            {"3剑士","剑士的每次攻击有35%几率打出1次额外攻击"},
            {"4剑士","剑士的每次攻击有35%几率打出1次额外攻击"},
            {"5剑士","剑士的每次攻击有35%几率打出1次额外攻击"},
            {"6剑士","拥有6个剑士时，剑士的每次攻击有35%几率打出2次额外攻击"},
            {"2斗士","斗士获得额外的300点最大生命值"},
            {"3斗士","斗士获得额外的300点最大生命值"},
            {"4斗士","斗士获得额外的700点最大生命值"},
            {"3元素使","在战斗开始时，召唤一个元素之灵"},
            {"2护卫","在战斗开始时，所有护卫和邻近格子的友军获得40点护甲加成"},
            {"2枪手","在攻击之后，枪手的攻击有50%几率对随机一个敌人打出额外攻击"},
            {"3枪手","在攻击之后，枪手的攻击有50%几率对随机一个敌人打出额外攻击"},
            {"4枪手","拥有4个枪手时，枪手的攻击有50%几率对范围内2个敌人打出额外攻击"},
            {"2骑士","骑士格挡来自普攻的20点伤害"},
            {"3骑士","骑士格挡来自普攻的20点伤害"},
            {"4骑士","骑士格挡来自普攻的40点伤害"},
            {"6骑士","骑士格挡来自普攻的80点伤害"},
            {"2游侠","每过3秒，游侠有25%几率来使他们的攻速翻倍，持续3秒"},
            {"3游侠","每过3秒，游侠有25%几率来使他们的攻速翻倍，持续3秒"},
            {"4游侠","每过3秒，游侠有65%几率来使他们的攻速翻倍，持续3秒"},
            {"3换形师","换形师会在他们变形时获得额外的60%最大生命值"}
        };
    }
}
